In [1]:
import pandas as pd

### String Data processing

In [2]:
horror_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/horror-train.csv')

In [3]:
horror_data.head()

        id                                               text author
0  id26305  This process, however, afforded me no means of...    EAP
1  id17569  It never once occurred to me that the fumbling...    HPL
2  id11008  In his left hand was a gold snuff box, from wh...    EAP
3  id27763  How lovely is spring As we looked from Windsor...    MWS
4  id12958  Finding nothing else, not even gold, the Super...    HPL

In [4]:
horror_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19579 entries, 0 to 19578
Data columns (total 3 columns):
id        19579 non-null object
text      19579 non-null object
author    19579 non-null object
dtypes: object(3)
memory usage: 459.0+ KB

* How many authors are there ?

In [5]:
horror_data.author.unique()

array(['EAP', 'HPL', 'MWS'], dtype=object)

* What is the author distribution ?

In [6]:
horror_data.author.value_counts()

EAP    7900
MWS    6044
HPL    5635
Name: author, dtype: int64

* Find all the texts for EAP

In [7]:
horror_data[horror_data.author == 'EAP']['text'][:5]

0    This process, however, afforded me no means of...
2    In his left hand was a gold snuff box, from wh...
6    The astronomer, perhaps, at this point, took r...
7          The surcingle hung in ribands from my body.
8    I knew that you could not say to yourself 'ste...
Name: text, dtype: object

* Find out the row with longest text

In [8]:
horror_data['text_len'] = horror_data.text.str.len()

In [9]:
horror_data.head()

        id                                               text author  text_len
0  id26305  This process, however, afforded me no means of...    EAP       231
1  id17569  It never once occurred to me that the fumbling...    HPL        71
2  id11008  In his left hand was a gold snuff box, from wh...    EAP       200
3  id27763  How lovely is spring As we looked from Windsor...    MWS       206
4  id12958  Finding nothing else, not even gold, the Super...    HPL       174

In [10]:
c = horror_data.text

In [12]:
c.str

In [13]:
horror_data.text_len.max()

4663

In [14]:
horror_data[horror_data.text_len == 4663]

,id,text,author,text_len
9215,id27184,Diotima approached the fountain seated herself...,MWS,4663

In [15]:
max(horror_data.text_len)

4663

* Filter the rows having the word 'hand' in it

In [16]:
horror_data[horror_data.text.str.contains('hand')].head()

,id,text,author,text_len
2,id11008,"In his left hand was a gold snuff box, from wh...",EAP,200
22,id18925,"On every hand was a wilderness of balconies, o...",EAP,115
23,id19925,With how deep a spirit of wonder and perplexit...,EAP,460
90,id03833,The ex queen gives me Idris; Adrian is totally...,MWS,130
147,id05876,I look on the hands which executed the deed; I...,MWS,224

* Find the rows with maximum number of words

In [3]:
horror_data['list_words'] = horror_data.text.str.split()
horror_data

,id,text,author,list_words
0,id26305,"This process, however, afforded me no means of...",EAP,"[This, process,, however,, afforded, me, no, m..."
1,id17569,It never once occurred to me that the fumbling...,HPL,"[It, never, once, occurred, to, me, that, the,..."
2,id11008,"In his left hand was a gold snuff box, from wh...",EAP,"[In, his, left, hand, was, a, gold, snuff, box..."
3,id27763,How lovely is spring As we looked from Windsor...,MWS,"[How, lovely, is, spring, As, we, looked, from..."
4,id12958,"Finding nothing else, not even gold, the Super...",HPL,"[Finding, nothing, else,, not, even, gold,, th..."
...,...,...,...,...
19574,id17718,"I could have fancied, while I looked at it, th...",EAP,"[I, could, have, fancied,, while, I, looked, a..."
19575,id08973,The lids clenched themselves together as if in...,EAP,"[The, lids, clenched, themselves, together, as..."
19576,id05267,"Mais il faut agir that is to say, a Frenchman ...",EAP,"[Mais, il, faut, agir, that, is, to, say,, a, ..."
19577,id17513,"For an item of news like this, it strikes us i...",EAP,"[For, an, item, of, news, like, this,, it, str..."
19578,id00393,"He laid a gnarled claw on my shoulder, and it ...",HPL,"[He, laid, a, gnarled, claw, on, my, shoulder,..."

In [4]:
horror_data['num_words'] = horror_data.list_words.map(lambda r:len(r))
horror_data

,id,text,author,list_words,num_words
0,id26305,"This process, however, afforded me no means of...",EAP,"[This, process,, however,, afforded, me, no, m...",41
1,id17569,It never once occurred to me that the fumbling...,HPL,"[It, never, once, occurred, to, me, that, the,...",14
2,id11008,"In his left hand was a gold snuff box, from wh...",EAP,"[In, his, left, hand, was, a, gold, snuff, box...",36
3,id27763,How lovely is spring As we looked from Windsor...,MWS,"[How, lovely, is, spring, As, we, looked, from...",34
4,id12958,"Finding nothing else, not even gold, the Super...",HPL,"[Finding, nothing, else,, not, even, gold,, th...",27
...,...,...,...,...,...
19574,id17718,"I could have fancied, while I looked at it, th...",EAP,"[I, could, have, fancied,, while, I, looked, a...",20
19575,id08973,The lids clenched themselves together as if in...,EAP,"[The, lids, clenched, themselves, together, as...",10
19576,id05267,"Mais il faut agir that is to say, a Frenchman ...",EAP,"[Mais, il, faut, agir, that, is, to, say,, a, ...",13
19577,id17513,"For an item of news like this, it strikes us i...",EAP,"[For, an, item, of, news, like, this,, it, str...",15
19578,id00393,"He laid a gnarled claw on my shoulder, and it ...",HPL,"[He, laid, a, gnarled, claw, on, my, shoulder,...",22

In [5]:
horror_data.num_words.max()

861

In [6]:
horror_data[horror_data.num_words == 861]

,id,text,author,list_words,num_words
9215,id27184,Diotima approached the fountain seated herself...,MWS,"[Diotima, approached, the, fountain, seated, h...",861

#### Find the rows with maximum number of uppercase words (first char is uppercase)
- Break down text into words (already done, list_words)
- Find words with first character uppercase
- Do the count

In [8]:
def f(r):
    return len(list(filter( lambda w: w.istitle(),r)))

horror_data['title_words'] = horror_data.list_words.map(f)
horror_data

,id,text,author,list_words,num_words,title_words
0,id26305,"This process, however, afforded me no means of...",EAP,"[This, process,, however,, afforded, me, no, m...",41,3
1,id17569,It never once occurred to me that the fumbling...,HPL,"[It, never, once, occurred, to, me, that, the,...",14,1
2,id11008,"In his left hand was a gold snuff box, from wh...",EAP,"[In, his, left, hand, was, a, gold, snuff, box...",36,1
3,id27763,How lovely is spring As we looked from Windsor...,MWS,"[How, lovely, is, spring, As, we, looked, from...",34,4
4,id12958,"Finding nothing else, not even gold, the Super...",HPL,"[Finding, nothing, else,, not, even, gold,, th...",27,2
...,...,...,...,...,...,...
19574,id17718,"I could have fancied, while I looked at it, th...",EAP,"[I, could, have, fancied,, while, I, looked, a...",20,2
19575,id08973,The lids clenched themselves together as if in...,EAP,"[The, lids, clenched, themselves, together, as...",10,1
19576,id05267,"Mais il faut agir that is to say, a Frenchman ...",EAP,"[Mais, il, faut, agir, that, is, to, say,, a, ...",13,2
19577,id17513,"For an item of news like this, it strikes us i...",EAP,"[For, an, item, of, news, like, this,, it, str...",15,1
19578,id00393,"He laid a gnarled claw on my shoulder, and it ...",HPL,"[He, laid, a, gnarled, claw, on, my, shoulder,...",22,1

In [9]:
horror_data.title_words.max()

46

In [10]:
horror_data[horror_data.title_words == 46]

,id,text,author,list_words,num_words,title_words
9215,id27184,Diotima approached the fountain seated herself...,MWS,"[Diotima, approached, the, fountain, seated, h...",861,46

### Handling Missing values
* Two stratagies
  - Fill the missing values
  - Delete the rows with missing values

In [11]:
titanic_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/titanic-train.csv.txt')

In [12]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Inferance 
* Age, Cabin & Embarked has missing values

#### Q.Find all the rows in which age is missing

In [14]:
titanic_data[titanic_data.Age.isnull()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

### Q. Find all the rows in which Embarked is missing

In [15]:
titanic_data[titanic_data.Embarked.isnull()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

### Q.Identify mean age of the people travelling in titanic

In [16]:
titanic_data.Age.mean()

29.69911764705882

In [17]:
titanic_data.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

### Q. Replace missing age by mean value, cabin & embarked
* fillna()

In [21]:
titanic_data.fillna({'Age':29.7, 'Embarked':'S'}, inplace=True)

In [22]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Drop null values 
* Loading data again

In [25]:
titanic_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/titanic-train.csv.txt')
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Q. Drop the rows in which age, Cabin, Embarked is missing

In [33]:
drop_na = titanic_data.dropna(subset=["Age","Cabin","Embarked"])

In [38]:
titanic_data.dropna(inplace=True)

In [39]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
PassengerId    183 non-null int64
Survived       183 non-null int64
Pclass         183 non-null int64
Name           183 non-null object
Sex            183 non-null object
Age            183 non-null float64
SibSp          183 non-null int64
Parch          183 non-null int64
Ticket         183 non-null object
Fare           183 non-null float64
Cabin          183 non-null object
Embarked       183 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB